#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=17e0353ca4c5e46ab918cea3a11c9f17973fb37d]
local_file.tfkey: Refreshing state... [id=4a97d008d9f3a39fad7688b5a2e55ba1c828e752]
aws_vpc.main: Refreshing state... [id=vpc-08fbeb5c2a5835b4e]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230130165959371300000001]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-06c2ffe7cddb975e9]
data.aws_ami.java-ami: Reading...
data.aws_ami.java-ami: Read complete after 1s [id=ami-02281c8b0a2646f13]
aws_security_group.allow_http: Refreshing state... [id=sg-01ffed9190e0d3190]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0247ba74caefb45d0]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0ff8833ee3e0be13a]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0580c609a910206af]
aws_security_group.elb: Refreshing state... [id=sg-03574d5c884dc9d19]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-09fd503ac2f813803]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-098b2568cb30e628f]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0b8cef58390019c0b]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0452b383680928659]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-02c9909aba6a7f0c8]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_instance.bastion-host: Refreshing state... [id=i-070d5a43cbc5ac12f]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-03c6b7ab7626ac70e]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0f9246c231b62777b]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0781cd91364473b0f]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0a4bc636bdecd5586]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-02712839d0ec66f31]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = "Auto Scaling Group"
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ launch_configuration      = "terraform-20230130165959371300000001" -> (known after apply)
        name                      = "Auto Scaling Group"
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.ec2_config will be destroyed
  # (because aws_launch_configuration.ec2_config is not in configuration)
  - resource "aws_launch_configuration" "ec2_config" {
      - arn                              = "arn:aws:autoscaling:us-east-1:856624563978:launchConfiguration:ba32a49f-2beb-4170-93eb-4e0f64eef1de:launchConfigurationName/terraform-20230130165959371300000001" -> null
      - associate_public_ip_address      = false -> null
      - ebs_optimized                    = false -> null
      - enable_monitoring                = true -> null
      - id                               = "terraform-20230130165959371300000001" -> null
      - image_id                         = "ami-03f9c676d52811cf1" -> null
      - instance_type                    = "t2.micro" -> null
      - key_name                         = "terraform_key" -> null
      - name                             = "terraform-20230130165959371300000001" -> null
      - name_prefix                      = "terraform-" -> null
      - security_groups                  = [
          - "sg-01ffed9190e0d3190",
          - "sg-03574d5c884dc9d19",
          - "sg-0b8cef58390019c0b",
        ] -> null
      - user_data                        = "c0474efef832d7529152836d553c672a37995254" -> null
      - vpc_classic_link_security_groups = [] -> null
    }

  # aws_launch_template.ec2_config will be created
  + resource "aws_launch_template" "ec2_config" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-02281c8b0a2646f13"
      + instance_type          = "t2.micro"
      + key_name               = "terraform_key"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKbm9odXAgamF2YSAtamFyIC9vcHQvZGVwbG95bWVudC9teWFwcC5qYXIgLS1zZXJ2ZXIucG9ydD04MDgwID4gL3Zhci9sb2cvYXBwcy9teWFwcC5sb2cgMj4mMSAm"
      + vpc_security_group_ids = [
          + "sg-01ffed9190e0d3190",
          + "sg-03574d5c884dc9d19",
          + "sg-0b8cef58390019c0b",
        ]

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*